#+title: Direct

#+begin_src emacs-lisp :results none
(add-to-list 'org-structure-template-alist '("yy" . "src jupyter-python :session localhost :kernel yandex"))

(add-to-list 'org-structure-template-alist '("yyr" . "src jupyter-python :session localhost :kernel yandex :results none"))

(add-to-list 'org-structure-template-alist '("yyt" . "src jupyter-python :session localhost :kernel yandex :results none :tangle etl.py"))
#+end_src

** Loading
#+begin_src jupyter-python :session localhost :kernel yandex :results none :tangle sender.py
def send_stats(account):
    df = pd.read_csv(f"tmp_data/{account}.tsv", delimiter="\t")
    table_ref = client.dataset("yandex_oddjob").table(
        f"dw_report_{account}")
    try:
        jobdel = client.delete_table(table_ref)
        logger.info(jobdel.result())
    except NotFound:
        pass
    jobcre = client.create_table(table_ref)
    logger.info(jobcre.result())
    job = client.load_table_from_dataframe(df, table_ref)
    logger.success(job.result())
#+end_src

#+RESULTS:
: LoadJob<project=oddjob-db-2007, location=US, id=72613168-1a86-487e-af3e-da73cdb2a653>

